In [62]:
import pandas as pd

In [63]:
# Cell 2: Create a DataFrame
data = {
    "Name": ["Vishal", "Rao", "Radhika", "Dinesh"],
    "Age": [19, 50 , 40, 12],
    "City": ["Vizag", "Hyderabad", "Delhi", "Chennai"],
}
df = pd.DataFrame(data)
df.head()

      Name  Age       City
0   Vishal   19      Vizag
1      Rao   50  Hyderabad
2  Radhika   40      Delhi
3   Dinesh   12    Chennai

In [64]:
# Cell 4: Describe the data
df.describe()

             Age
count   4.000000
mean   30.250000
std    17.745892
min    12.000000
25%    17.250000
50%    29.500000
75%    42.500000
max    50.000000

In [65]:
# Cell 6: Fill missing values
df_with_nan = df.copy()
df_with_nan.loc[2, "Age"] = None
filled_df = df_with_nan.fillna(df_with_nan["Age"].mean())
filled_df

      Name   Age       City
0   Vishal  19.0      Vizag
1      Rao  50.0  Hyderabad
2  Radhika  27.0      Delhi
3   Dinesh  12.0    Chennai

In [66]:
# Cell 7: Drop a column
df_dropped = df.drop(columns=["City"])
df_dropped

      Name  Age
0   Vishal   19
1      Rao   50
2  Radhika   40
3   Dinesh   12